Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/nmic.h
/* -------- NMIC_ISR : (NMIC Offset: 0x0C) ( R/ 32) Interrupt Status Register -------- */
#define NMIC_ISR_NMI0_Pos                     _U_(0)                                               /**< (NMIC_ISR) Non-maskable Interrupt Source 0 Pending (cleared on read) Position */
#define NMIC_ISR_NMI0_Msk                     (_U_(0x1) << NMIC_ISR_NMI0_Pos)                      /**< (NMIC_ISR) Non-maskable Interrupt Source 0 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI0(value)                  (NMIC_ISR_NMI0_Msk & ((value) << NMIC_ISR_NMI0_Pos))
#define NMIC_ISR_NMI1_Pos                     _U_(1)                                               /**< (NMIC_ISR) Non-maskable Interrupt Source 1 Pending (cleared on read) Position */
#define NMIC_ISR_NMI1_Msk                     (_U_(0x1) << NMIC_ISR_NMI1_Pos)                      /**< (NMIC_ISR) Non-maskable Interrupt Source 1 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI1(value)                  (NMIC_ISR_NMI1_Msk & ((value) << NMIC_ISR_NMI1_Pos))
#define NMIC_ISR_NMI2_Pos                     _U_(2)                                               /**< (NMIC_ISR) Non-maskable Interrupt Source 2 Pending (cleared on read) Position */
#define NMIC_ISR_NMI2_Msk                     (_U_(0x1) << NMIC_ISR_NMI2_Pos)                      /**< (NMIC_ISR) Non-maskable Interrupt Source 2 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI2(value)                  (NMIC_ISR_NMI2_Msk & ((value) << NMIC_ISR_NMI2_Pos))
#define NMIC_ISR_NMI3_Pos                     _U_(3)                                               /**< (NMIC_ISR) Non-maskable Interrupt Source 3 Pending (cleared on read) Position */
#define NMIC_ISR_NMI3_Msk                     (_U_(0x1) << NMIC_ISR_NMI3_Pos)                      /**< (NMIC_ISR) Non-maskable Interrupt Source 3 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI3(value)                  (NMIC_ISR_NMI3_Msk & ((value) << NMIC_ISR_NMI3_Pos))
#define NMIC_ISR_NMI4_Pos                     _U_(4)                                               /**< (NMIC_ISR) Non-maskable Interrupt Source 4 Pending (cleared on read) Position */
#define NMIC_ISR_NMI4_Msk                     (_U_(0x1) << NMIC_ISR_NMI4_Pos)                      /**< (NMIC_ISR) Non-maskable Interrupt Source 4 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI4(value)                  (NMIC_ISR_NMI4_Msk & ((value) << NMIC_ISR_NMI4_Pos))
#define NMIC_ISR_NMI5_Pos                     _U_(5)                                               /**< (NMIC_ISR) Non-maskable Interrupt Source 5 Pending (cleared on read) Position */
#define NMIC_ISR_NMI5_Msk                     (_U_(0x1) << NMIC_ISR_NMI5_Pos)                      /**< (NMIC_ISR) Non-maskable Interrupt Source 5 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI5(value)                  (NMIC_ISR_NMI5_Msk & ((value) << NMIC_ISR_NMI5_Pos))
#define NMIC_ISR_NMI6_Pos                     _U_(6)                                               /**< (NMIC_ISR) Non-maskable Interrupt Source 6 Pending (cleared on read) Position */
#define NMIC_ISR_NMI6_Msk                     (_U_(0x1) << NMIC_ISR_NMI6_Pos)                      /**< (NMIC_ISR) Non-maskable Interrupt Source 6 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI6(value)                  (NMIC_ISR_NMI6_Msk & ((value) << NMIC_ISR_NMI6_Pos))
#define NMIC_ISR_NMI7_Pos                     _U_(7)                                               /**< (NMIC_ISR) Non-maskable Interrupt Source 7 Pending (cleared on read) Position */
#define NMIC_ISR_NMI7_Msk                     (_U_(0x1) << NMIC_ISR_NMI7_Pos)                      /**< (NMIC_ISR) Non-maskable Interrupt Source 7 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI7(value)                  (NMIC_ISR_NMI7_Msk & ((value) << NMIC_ISR_NMI7_Pos))
#define NMIC_ISR_NMI8_Pos                     _U_(8)                                               /**< (NMIC_ISR) Non-maskable Interrupt Source 8 Pending (cleared on read) Position */
#define NMIC_ISR_NMI8_Msk                     (_U_(0x1) << NMIC_ISR_NMI8_Pos)                      /**< (NMIC_ISR) Non-maskable Interrupt Source 8 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI8(value)                  (NMIC_ISR_NMI8_Msk & ((value) << NMIC_ISR_NMI8_Pos))
#define NMIC_ISR_NMI9_Pos                     _U_(9)                                               /**< (NMIC_ISR) Non-maskable Interrupt Source 9 Pending (cleared on read) Position */
#define NMIC_ISR_NMI9_Msk                     (_U_(0x1) << NMIC_ISR_NMI9_Pos)                      /**< (NMIC_ISR) Non-maskable Interrupt Source 9 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI9(value)                  (NMIC_ISR_NMI9_Msk & ((value) << NMIC_ISR_NMI9_Pos))
#define NMIC_ISR_NMI10_Pos                    _U_(10)                                              /**< (NMIC_ISR) Non-maskable Interrupt Source 10 Pending (cleared on read) Position */
#define NMIC_ISR_NMI10_Msk                    (_U_(0x1) << NMIC_ISR_NMI10_Pos)                     /**< (NMIC_ISR) Non-maskable Interrupt Source 10 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI10(value)                 (NMIC_ISR_NMI10_Msk & ((value) << NMIC_ISR_NMI10_Pos))
#define NMIC_ISR_NMI11_Pos                    _U_(11)                                              /**< (NMIC_ISR) Non-maskable Interrupt Source 11 Pending (cleared on read) Position */
#define NMIC_ISR_NMI11_Msk                    (_U_(0x1) << NMIC_ISR_NMI11_Pos)                     /**< (NMIC_ISR) Non-maskable Interrupt Source 11 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI11(value)                 (NMIC_ISR_NMI11_Msk & ((value) << NMIC_ISR_NMI11_Pos))
#define NMIC_ISR_NMI12_Pos                    _U_(12)                                              /**< (NMIC_ISR) Non-maskable Interrupt Source 12 Pending (cleared on read) Position */
#define NMIC_ISR_NMI12_Msk                    (_U_(0x1) << NMIC_ISR_NMI12_Pos)                     /**< (NMIC_ISR) Non-maskable Interrupt Source 12 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI12(value)                 (NMIC_ISR_NMI12_Msk & ((value) << NMIC_ISR_NMI12_Pos))
#define NMIC_ISR_NMI13_Pos                    _U_(13)                                              /**< (NMIC_ISR) Non-maskable Interrupt Source 13 Pending (cleared on read) Position */
#define NMIC_ISR_NMI13_Msk                    (_U_(0x1) << NMIC_ISR_NMI13_Pos)                     /**< (NMIC_ISR) Non-maskable Interrupt Source 13 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI13(value)                 (NMIC_ISR_NMI13_Msk & ((value) << NMIC_ISR_NMI13_Pos))
#define NMIC_ISR_NMI14_Pos                    _U_(14)                                              /**< (NMIC_ISR) Non-maskable Interrupt Source 14 Pending (cleared on read) Position */
#define NMIC_ISR_NMI14_Msk                    (_U_(0x1) << NMIC_ISR_NMI14_Pos)                     /**< (NMIC_ISR) Non-maskable Interrupt Source 14 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI14(value)                 (NMIC_ISR_NMI14_Msk & ((value) << NMIC_ISR_NMI14_Pos))
#define NMIC_ISR_NMI15_Pos                    _U_(15)                                              /**< (NMIC_ISR) Non-maskable Interrupt Source 15 Pending (cleared on read) Position */
#define NMIC_ISR_NMI15_Msk                    (_U_(0x1) << NMIC_ISR_NMI15_Pos)                     /**< (NMIC_ISR) Non-maskable Interrupt Source 15 Pending (cleared on read) Mask */
#define NMIC_ISR_NMI15(value)                 (NMIC_ISR_NMI15_Msk & ((value) << NMIC_ISR_NMI15_Pos))
#define NMIC_ISR_Msk                          _U_(0x0000FFFF)                                      /**< (NMIC_ISR) Register Mask  */

#define NMIC_ISR_NMI_Pos                      _U_(0)                                               /**< (NMIC_ISR Position) Non-maskable Interrupt Source x5 Pending (cleared on read) */
#define NMIC_ISR_NMI_Msk                      (_U_(0xFFFF) << NMIC_ISR_NMI_Pos)                    /**< (NMIC_ISR Mask) NMI */
#define NMIC_ISR_NMI(value)                   (NMIC_ISR_NMI_Msk & ((value) << NMIC_ISR_NMI_Pos))   

/* -------- NMIC_GFCS : (NMIC Offset: 0x10) ( R/ 32) Glitch Filter Configuration Status Register -------- */
#define NMIC_GFCS_RDY0_Pos                    _U_(0)                                               /**< (NMIC_GFCS) Filter 0 Configuration Ready Position */
#define NMIC_GFCS_RDY0_Msk                    (_U_(0x1) << NMIC_GFCS_RDY0_Pos)                     /**< (NMIC_GFCS) Filter 0 Configuration Ready Mask */
#define NMIC_GFCS_RDY0(value)                 (NMIC_GFCS_RDY0_Msk & ((value) << NMIC_GFCS_RDY0_Pos))
#define NMIC_GFCS_RDY1_Pos                    _U_(1)                                               /**< (NMIC_GFCS) Filter 1 Configuration Ready Position */
#define NMIC_GFCS_RDY1_Msk                    (_U_(0x1) << NMIC_GFCS_RDY1_Pos)                     /**< (NMIC_GFCS) Filter 1 Configuration Ready Mask */
#define NMIC_GFCS_RDY1(value)                 (NMIC_GFCS_RDY1_Msk & ((value) << NMIC_GFCS_RDY1_Pos))
#define NMIC_GFCS_RDY2_Pos                    _U_(2)                                               /**< (NMIC_GFCS) Filter 2 Configuration Ready Position */
#define NMIC_GFCS_RDY2_Msk                    (_U_(0x1) << NMIC_GFCS_RDY2_Pos)                     /**< (NMIC_GFCS) Filter 2 Configuration Ready Mask */
#define NMIC_GFCS_RDY2(value)                 (NMIC_GFCS_RDY2_Msk & ((value) << NMIC_GFCS_RDY2_Pos))
#define NMIC_GFCS_RDY3_Pos                    _U_(3)                                               /**< (NMIC_GFCS) Filter 3 Configuration Ready Position */
#define NMIC_GFCS_RDY3_Msk                    (_U_(0x1) << NMIC_GFCS_RDY3_Pos)                     /**< (NMIC_GFCS) Filter 3 Configuration Ready Mask */
#define NMIC_GFCS_RDY3(value)                 (NMIC_GFCS_RDY3_Msk & ((value) << NMIC_GFCS_RDY3_Pos))
#define NMIC_GFCS_RDY4_Pos                    _U_(4)                                               /**< (NMIC_GFCS) Filter 4 Configuration Ready Position */
#define NMIC_GFCS_RDY4_Msk                    (_U_(0x1) << NMIC_GFCS_RDY4_Pos)                     /**< (NMIC_GFCS) Filter 4 Configuration Ready Mask */
#define NMIC_GFCS_RDY4(value)                 (NMIC_GFCS_RDY4_Msk & ((value) << NMIC_GFCS_RDY4_Pos))
#define NMIC_GFCS_RDY5_Pos                    _U_(5)                                               /**< (NMIC_GFCS) Filter 5 Configuration Ready Position */
#define NMIC_GFCS_RDY5_Msk                    (_U_(0x1) << NMIC_GFCS_RDY5_Pos)                     /**< (NMIC_GFCS) Filter 5 Configuration Ready Mask */
#define NMIC_GFCS_RDY5(value)                 (NMIC_GFCS_RDY5_Msk & ((value) << NMIC_GFCS_RDY5_Pos))
#define NMIC_GFCS_RDY6_Pos                    _U_(6)                                               /**< (NMIC_GFCS) Filter 6 Configuration Ready Position */
#define NMIC_GFCS_RDY6_Msk                    (_U_(0x1) << NMIC_GFCS_RDY6_Pos)                     /**< (NMIC_GFCS) Filter 6 Configuration Ready Mask */
#define NMIC_GFCS_RDY6(value)                 (NMIC_GFCS_RDY6_Msk & ((value) << NMIC_GFCS_RDY6_Pos))
#define NMIC_GFCS_RDY7_Pos                    _U_(7)                                               /**< (NMIC_GFCS) Filter 7 Configuration Ready Position */
#define NMIC_GFCS_RDY7_Msk                    (_U_(0x1) << NMIC_GFCS_RDY7_Pos)                     /**< (NMIC_GFCS) Filter 7 Configuration Ready Mask */
#define NMIC_GFCS_RDY7(value)                 (NMIC_GFCS_RDY7_Msk & ((value) << NMIC_GFCS_RDY7_Pos))
#define NMIC_GFCS_RDY8_Pos                    _U_(8)                                               /**< (NMIC_GFCS) Filter 8 Configuration Ready Position */
#define NMIC_GFCS_RDY8_Msk                    (_U_(0x1) << NMIC_GFCS_RDY8_Pos)                     /**< (NMIC_GFCS) Filter 8 Configuration Ready Mask */
#define NMIC_GFCS_RDY8(value)                 (NMIC_GFCS_RDY8_Msk & ((value) << NMIC_GFCS_RDY8_Pos))
#define NMIC_GFCS_RDY9_Pos                    _U_(9)                                               /**< (NMIC_GFCS) Filter 9 Configuration Ready Position */
#define NMIC_GFCS_RDY9_Msk                    (_U_(0x1) << NMIC_GFCS_RDY9_Pos)                     /**< (NMIC_GFCS) Filter 9 Configuration Ready Mask */
#define NMIC_GFCS_RDY9(value)                 (NMIC_GFCS_RDY9_Msk & ((value) << NMIC_GFCS_RDY9_Pos))
#define NMIC_GFCS_RDY10_Pos                   _U_(10)                                              /**< (NMIC_GFCS) Filter 10 Configuration Ready Position */
#define NMIC_GFCS_RDY10_Msk                   (_U_(0x1) << NMIC_GFCS_RDY10_Pos)                    /**< (NMIC_GFCS) Filter 10 Configuration Ready Mask */
#define NMIC_GFCS_RDY10(value)                (NMIC_GFCS_RDY10_Msk & ((value) << NMIC_GFCS_RDY10_Pos))
#define NMIC_GFCS_RDY11_Pos                   _U_(11)                                              /**< (NMIC_GFCS) Filter 11 Configuration Ready Position */
#define NMIC_GFCS_RDY11_Msk                   (_U_(0x1) << NMIC_GFCS_RDY11_Pos)                    /**< (NMIC_GFCS) Filter 11 Configuration Ready Mask */
#define NMIC_GFCS_RDY11(value)                (NMIC_GFCS_RDY11_Msk & ((value) << NMIC_GFCS_RDY11_Pos))
#define NMIC_GFCS_RDY12_Pos                   _U_(12)                                              /**< (NMIC_GFCS) Filter 12 Configuration Ready Position */
#define NMIC_GFCS_RDY12_Msk                   (_U_(0x1) << NMIC_GFCS_RDY12_Pos)                    /**< (NMIC_GFCS) Filter 12 Configuration Ready Mask */
#define NMIC_GFCS_RDY12(value)                (NMIC_GFCS_RDY12_Msk & ((value) << NMIC_GFCS_RDY12_Pos))
#define NMIC_GFCS_RDY13_Pos                   _U_(13)                                              /**< (NMIC_GFCS) Filter 13 Configuration Ready Position */
#define NMIC_GFCS_RDY13_Msk                   (_U_(0x1) << NMIC_GFCS_RDY13_Pos)                    /**< (NMIC_GFCS) Filter 13 Configuration Ready Mask */
#define NMIC_GFCS_RDY13(value)                (NMIC_GFCS_RDY13_Msk & ((value) << NMIC_GFCS_RDY13_Pos))
#define NMIC_GFCS_RDY14_Pos                   _U_(14)                                              /**< (NMIC_GFCS) Filter 14 Configuration Ready Position */
#define NMIC_GFCS_RDY14_Msk                   (_U_(0x1) << NMIC_GFCS_RDY14_Pos)                    /**< (NMIC_GFCS) Filter 14 Configuration Ready Mask */
#define NMIC_GFCS_RDY14(value)                (NMIC_GFCS_RDY14_Msk & ((value) << NMIC_GFCS_RDY14_Pos))
#define NMIC_GFCS_RDY15_Pos                   _U_(15)                                              /**< (NMIC_GFCS) Filter 15 Configuration Ready Position */
#define NMIC_GFCS_RDY15_Msk                   (_U_(0x1) << NMIC_GFCS_RDY15_Pos)                    /**< (NMIC_GFCS) Filter 15 Configuration Ready Mask */
#define NMIC_GFCS_RDY15(value)                (NMIC_GFCS_RDY15_Msk & ((value) << NMIC_GFCS_RDY15_Pos))
#define NMIC_GFCS_Msk                         _U_(0x0000FFFF)                                      /**< (NMIC_GFCS) Register Mask  */

#define NMIC_GFCS_RDY_Pos                     _U_(0)                                               /**< (NMIC_GFCS Position) Filter x5 Configuration Ready */
#define NMIC_GFCS_RDY_Msk                     (_U_(0xFFFF) << NMIC_GFCS_RDY_Pos)                   /**< (NMIC_GFCS Mask) RDY */
#define NMIC_GFCS_RDY(value)                  (NMIC_GFCS_RDY_Msk & ((value) << NMIC_GFCS_RDY_Pos)) 

/* -------- NMIC_SCFGxR0 : (NMIC Offset: 0x14) (R/W 32) Source Configuration Register 0 0 -------- */
#define NMIC_SCFGxR0_GFSEL_Pos                _U_(0)                                               /**< (NMIC_SCFGxR0) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR0_GFSEL_Msk                (_U_(0x3) << NMIC_SCFGxR0_GFSEL_Pos)                 /**< (NMIC_SCFGxR0) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR0_GFSEL(value)             (NMIC_SCFGxR0_GFSEL_Msk & ((value) << NMIC_SCFGxR0_GFSEL_Pos))
#define NMIC_SCFGxR0_GFEN_Pos                 _U_(4)                                               /**< (NMIC_SCFGxR0) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR0_GFEN_Msk                 (_U_(0x1) << NMIC_SCFGxR0_GFEN_Pos)                  /**< (NMIC_SCFGxR0) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR0_GFEN(value)              (NMIC_SCFGxR0_GFEN_Msk & ((value) << NMIC_SCFGxR0_GFEN_Pos))
#define NMIC_SCFGxR0_POL_Pos                  _U_(8)                                               /**< (NMIC_SCFGxR0) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR0_POL_Msk                  (_U_(0x1) << NMIC_SCFGxR0_POL_Pos)                   /**< (NMIC_SCFGxR0) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR0_POL(value)               (NMIC_SCFGxR0_POL_Msk & ((value) << NMIC_SCFGxR0_POL_Pos))
#define NMIC_SCFGxR0_LVL_Pos                  _U_(9)                                               /**< (NMIC_SCFGxR0) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR0_LVL_Msk                  (_U_(0x1) << NMIC_SCFGxR0_LVL_Pos)                   /**< (NMIC_SCFGxR0) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR0_LVL(value)               (NMIC_SCFGxR0_LVL_Msk & ((value) << NMIC_SCFGxR0_LVL_Pos))
#define NMIC_SCFGxR0_EN_Pos                   _U_(16)                                              /**< (NMIC_SCFGxR0) Source Enable Position */
#define NMIC_SCFGxR0_EN_Msk                   (_U_(0x1) << NMIC_SCFGxR0_EN_Pos)                    /**< (NMIC_SCFGxR0) Source Enable Mask */
#define NMIC_SCFGxR0_EN(value)                (NMIC_SCFGxR0_EN_Msk & ((value) << NMIC_SCFGxR0_EN_Pos))
#define NMIC_SCFGxR0_FRZ_Pos                  _U_(31)                                              /**< (NMIC_SCFGxR0) Interrupt Line Freeze Position */
#define NMIC_SCFGxR0_FRZ_Msk                  (_U_(0x1) << NMIC_SCFGxR0_FRZ_Pos)                   /**< (NMIC_SCFGxR0) Interrupt Line Freeze Mask */
#define NMIC_SCFGxR0_FRZ(value)               (NMIC_SCFGxR0_FRZ_Msk & ((value) << NMIC_SCFGxR0_FRZ_Pos))
#define NMIC_SCFGxR0_Msk                      _U_(0x80010313)                                      /**< (NMIC_SCFGxR0) Register Mask  */


/* -------- NMIC_SCFGxR1 : (NMIC Offset: 0x18) (R/W 32) Source Configuration Register 0 1 -------- */
#define NMIC_SCFGxR1_GFSEL_Pos                _U_(0)                                               /**< (NMIC_SCFGxR1) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR1_GFSEL_Msk                (_U_(0x3) << NMIC_SCFGxR1_GFSEL_Pos)                 /**< (NMIC_SCFGxR1) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR1_GFSEL(value)             (NMIC_SCFGxR1_GFSEL_Msk & ((value) << NMIC_SCFGxR1_GFSEL_Pos))
#define NMIC_SCFGxR1_GFEN_Pos                 _U_(4)                                               /**< (NMIC_SCFGxR1) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR1_GFEN_Msk                 (_U_(0x1) << NMIC_SCFGxR1_GFEN_Pos)                  /**< (NMIC_SCFGxR1) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR1_GFEN(value)              (NMIC_SCFGxR1_GFEN_Msk & ((value) << NMIC_SCFGxR1_GFEN_Pos))
#define NMIC_SCFGxR1_POL_Pos                  _U_(8)                                               /**< (NMIC_SCFGxR1) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR1_POL_Msk                  (_U_(0x1) << NMIC_SCFGxR1_POL_Pos)                   /**< (NMIC_SCFGxR1) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR1_POL(value)               (NMIC_SCFGxR1_POL_Msk & ((value) << NMIC_SCFGxR1_POL_Pos))
#define NMIC_SCFGxR1_LVL_Pos                  _U_(9)                                               /**< (NMIC_SCFGxR1) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR1_LVL_Msk                  (_U_(0x1) << NMIC_SCFGxR1_LVL_Pos)                   /**< (NMIC_SCFGxR1) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR1_LVL(value)               (NMIC_SCFGxR1_LVL_Msk & ((value) << NMIC_SCFGxR1_LVL_Pos))
#define NMIC_SCFGxR1_EN_Pos                   _U_(16)                                              /**< (NMIC_SCFGxR1) Source Enable Position */
#define NMIC_SCFGxR1_EN_Msk                   (_U_(0x1) << NMIC_SCFGxR1_EN_Pos)                    /**< (NMIC_SCFGxR1) Source Enable Mask */
#define NMIC_SCFGxR1_EN(value)                (NMIC_SCFGxR1_EN_Msk & ((value) << NMIC_SCFGxR1_EN_Pos))
#define NMIC_SCFGxR1_FRZ_Pos                  _U_(31)                                              /**< (NMIC_SCFGxR1) Interrupt Line Freeze Position */
#define NMIC_SCFGxR1_FRZ_Msk                  (_U_(0x1) << NMIC_SCFGxR1_FRZ_Pos)                   /**< (NMIC_SCFGxR1) Interrupt Line Freeze Mask */
#define NMIC_SCFGxR1_FRZ(value)               (NMIC_SCFGxR1_FRZ_Msk & ((value) << NMIC_SCFGxR1_FRZ_Pos))
#define NMIC_SCFGxR1_Msk                      _U_(0x80010313)                                      /**< (NMIC_SCFGxR1) Register Mask  */


